school-back-end/app/controllers/api/v1/classe_courses_controller.rb

    def index
        classeCourses = ClasseCourse.all
---
SELECT "classe_courses".* FROM "classe_courses"