school-back-end/app/controllers/api/v1/courses_controller.rb

    def index
        courses = Course.all
---
SELECT "courses".* FROM "courses"