school-back-end/app/controllers/api/v1/grades_controller.rb

    def index
        grades = Grade.all
---
SELECT "grades".* FROM "grades"