school-back-end/app/controllers/api/v1/parent_students_controller.rb

    def index
        parentStudents = ParentStudent.all
---
SELECT "parent_students".* FROM "parent_students"