school-back-end/app/controllers/api/v1/parents_controller.rb

    def index
        # Parent = Parent.all.sort_by { |user| user.username }
        parents = Parent.all
---
SELECT "parents".* FROM "parents"