school-back-end/app/controllers/api/v1/professor_students_controller.rb

SELECT "professor_students".* FROM "professor_students"
---
    def index
        professorStudents = ProfessorStudent.all