school-back-end/app/controllers/api/v1/professors_controller.rb

SELECT "professors".* FROM "professors"
---
    def index
        professors = Professor.all