school-back-end/app/controllers/api/v1/student_courses_controller.rb

SELECT "student_courses".* FROM "student_courses"
---
    def index
        studentCourses = StudentCourse.all